Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningDoesnotCutHostDelete Property
 Opening does not cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningDoesnotCutHostDelete { get; }
Public Shared ReadOnly Property OpeningDoesnotCutHostDelete As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningDoesnotCutHostDelete {
	FailureDefinitionId^ get ();
}
static member OpeningDoesnotCutHostDelete : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace